tai/mbed-os/platformio/variants/NRF52840_DK/mbed_config.h

// Automatically generated configuration file.

# ifndef __MBED_CONFIG_DATA__
# define __MBED_CONFIG_DATA__

// Configuration parameters

#if !defined(MBED_CONF_TARGET_CONSOLE_UART_FLOW_CONTROL)
	#define MBED_CONF_TARGET_CONSOLE_UART_FLOW_CONTROL RTSCTS
#endif
#if !defined(MBED_CONF_PLATFORM_ERROR_DECODE_HTTP_URL_STR)
	#define MBED_CONF_PLATFORM_ERROR_DECODE_HTTP_URL_STR "\nFor more info, visit: https://armmbed.github.io/mbedos-error/?error=0x%08X"
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_DRIVERS_UART_SERIAL_TXBUF_SIZE)
	#define MBED_CONF_DRIVERS_UART_SERIAL_TXBUF_SIZE 256
#endif
#if !defined(MBED_CONF_PLATFORM_STDIO_BAUD_RATE)
	#define MBED_CONF_PLATFORM_STDIO_BAUD_RATE 9600
#endif
#if !defined(MBED_CONF_PLATFORM_MAX_ERROR_FILENAME_LEN)
	#define MBED_CONF_PLATFORM_MAX_ERROR_FILENAME_LEN 16
#endif
#if !defined(MBED_CONF_NORDIC_UART_0_FIFO_SIZE)
	#define MBED_CONF_NORDIC_UART_0_FIFO_SIZE 32
#endif
#if !defined(MBED_CONF_PLATFORM_ERROR_HIST_SIZE)
	#define MBED_CONF_PLATFORM_ERROR_HIST_SIZE 4
#endif
#if !defined(MBED_CONF_PLATFORM_ERROR_FILENAME_CAPTURE_ENABLED)
	#define MBED_CONF_PLATFORM_ERROR_FILENAME_CAPTURE_ENABLED 0
#endif
#if !defined(MBED_CONF_NORDIC_UART_DMA_SIZE)
	#define MBED_CONF_NORDIC_UART_DMA_SIZE 8
#endif
#if !defined(MBED_CONF_PLATFORM_DEFAULT_SERIAL_BAUD_RATE)
	#define MBED_CONF_PLATFORM_DEFAULT_SERIAL_BAUD_RATE 9600
#endif
#if !defined(MBED_CONF_PLATFORM_STDIO_BUFFERED_SERIAL)
	#define MBED_CONF_PLATFORM_STDIO_BUFFERED_SERIAL 0
#endif
#if !defined(MBED_CONF_NORDIC_UART_1_FIFO_SIZE)
	#define MBED_CONF_NORDIC_UART_1_FIFO_SIZE 32
#endif
#if !defined(MBED_CONF_PLATFORM_POLL_USE_LOWPOWER_TIMER)
	#define MBED_CONF_PLATFORM_POLL_USE_LOWPOWER_TIMER 0
#endif
#if !defined(MBED_CONF_PLATFORM_STDIO_FLUSH_AT_EXIT)
	#define MBED_CONF_PLATFORM_STDIO_FLUSH_AT_EXIT 1
#endif
#if !defined(MBED_CONF_PLATFORM_FORCE_NON_COPYABLE_ERROR)
	#define MBED_CONF_PLATFORM_FORCE_NON_COPYABLE_ERROR 0
#endif
#if !defined(MBED_CONF_PLATFORM_ERROR_ALL_THREADS_INFO)
	#define MBED_CONF_PLATFORM_ERROR_ALL_THREADS_INFO 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_UART_TIMEOUT_US)
	#define MBED_CONF_NORDIC_UART_TIMEOUT_US 2000
#endif
#if !defined(MBED_CONF_PLATFORM_STDIO_CONVERT_NEWLINES)
	#define MBED_CONF_PLATFORM_STDIO_CONVERT_NEWLINES 0
#endif
#if !defined(MBED_CONF_DRIVERS_UART_SERIAL_RXBUF_SIZE)
	#define MBED_CONF_DRIVERS_UART_SERIAL_RXBUF_SIZE 256
#endif
#if !defined(MBED_CONF_PLATFORM_STDIO_CONVERT_TTY_NEWLINES)
	#define MBED_CONF_PLATFORM_STDIO_CONVERT_TTY_NEWLINES 0
#endif
#if !defined(MBED_MEM_TRACING_ENABLED)
	#define MBED_MEM_TRACING_ENABLED 0
#endif
#if !defined(MBED_CONF_PLATFORM_ERROR_HIST_ENABLED)
	#define MBED_CONF_PLATFORM_ERROR_HIST_ENABLED 0
#endif
#if !defined(SWI_DISABLE2)
	#define SWI_DISABLE2
#endif
#if !defined(BLE_ADV_BLE_OBSERVER_PRIO)
	#define BLE_ADV_BLE_OBSERVER_PRIO 1
#endif
#if !defined(PEER_MANAGER_ENABLED)
	#define PEER_MANAGER_ENABLED 1
#endif
#if !defined(NRF_SD_BLE_API_VERSION)
	#define NRF_SD_BLE_API_VERSION 5
#endif
#if !defined(NRF_SDH_SOC_ENABLED)
	#define NRF_SDH_SOC_ENABLED 1
#endif
#if !defined(FDS_BACKEND)
	#define FDS_BACKEND 2
#endif
#if !defined(NRF_BLE_GATT_BLE_OBSERVER_PRIO)
	#define NRF_BLE_GATT_BLE_OBSERVER_PRIO 1
#endif
#if !defined(BLE_CONN_PARAMS_BLE_OBSERVER_PRIO)
	#define BLE_CONN_PARAMS_BLE_OBSERVER_PRIO 1
#endif
#if !defined(NRF_SDH_BLE_GATT_MAX_MTU_SIZE)
	#define NRF_SDH_BLE_GATT_MAX_MTU_SIZE 23
#endif
#if !defined(NRF_SDH_BLE_STACK_OBSERVER_PRIO)
	#define NRF_SDH_BLE_STACK_OBSERVER_PRIO 0
#endif
#if !defined(NRF_SDH_BLE_OBSERVER_PRIO_LEVELS)
	#define NRF_SDH_BLE_OBSERVER_PRIO_LEVELS 4
#endif
#if !defined(NRF_SDH_STACK_OBSERVER_PRIO_LEVELS)
	#define NRF_SDH_STACK_OBSERVER_PRIO_LEVELS 2
#endif
#if !defined(NRF_SDH_BLE_GAP_EVENT_LENGTH)
	#define NRF_SDH_BLE_GAP_EVENT_LENGTH 3
#endif
#if !defined(NRF_SDH_STATE_OBSERVER_PRIO_LEVELS)
	#define NRF_SDH_STATE_OBSERVER_PRIO_LEVELS 2
#endif
#if !defined(BLE_CONN_STATE_BLE_OBSERVER_PRIO)
	#define BLE_CONN_STATE_BLE_OBSERVER_PRIO 0
#endif
#if !defined(SWI_DISABLE4)
	#define SWI_DISABLE4
#endif
#if !defined(SWI_DISABLE5)
	#define SWI_DISABLE5
#endif
#if !defined(SWI_DISABLE0)
	#define SWI_DISABLE0
#endif
#if !defined(BLE_STACK_SUPPORT_REQD)
	#define BLE_STACK_SUPPORT_REQD
#endif
#if !defined(S140)
	#define S140
#endif
#if !defined(SWI_DISABLE3)
	#define SWI_DISABLE3
#endif
#if !defined(NRF_SDH_REQ_OBSERVER_PRIO_LEVELS)
	#define NRF_SDH_REQ_OBSERVER_PRIO_LEVELS 2
#endif
#if !defined(NRF_SDH_BLE_ENABLED)
	#define NRF_SDH_BLE_ENABLED 1
#endif
#if !defined(NRF_SDH_SOC_STACK_OBSERVER_PRIO)
	#define NRF_SDH_SOC_STACK_OBSERVER_PRIO 0
#endif
#if !defined(NRF_SDH_CLOCK_LF_XTAL_ACCURACY)
	#define NRF_SDH_CLOCK_LF_XTAL_ACCURACY 7
#endif
#if !defined(NRF_SDH_DISPATCH_MODEL)
	#define NRF_SDH_DISPATCH_MODEL 2
#endif
#if !defined(NRF_SDH_SOC_OBSERVER_PRIO_LEVELS)
	#define NRF_SDH_SOC_OBSERVER_PRIO_LEVELS 2
#endif
#if !defined(NRF_SDH_ENABLED)
	#define NRF_SDH_ENABLED 1
#endif
#if !defined(SOFTDEVICE_PRESENT)
	#define SOFTDEVICE_PRESENT 1
#endif
#if !defined(SWI_DISABLE1)
	#define SWI_DISABLE1
#endif
#if !defined(MBED_CONF_ATMEL_RF_LOW_SPI_SPEED)
	#define MBED_CONF_ATMEL_RF_LOW_SPI_SPEED 3750000
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_ATMEL_RF_USE_SPI_SPACING_API)
	#define MBED_CONF_ATMEL_RF_USE_SPI_SPACING_API 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_ATMEL_RF_FULL_SPI_SPEED)
	#define MBED_CONF_ATMEL_RF_FULL_SPI_SPEED 7500000
#endif
#if !defined(MBED_CONF_ATMEL_RF_PROVIDE_DEFAULT)
	#define MBED_CONF_ATMEL_RF_PROVIDE_DEFAULT 0
#endif
#if !defined(MBED_CONF_ATMEL_RF_ASSUME_SPACED_SPI)
	#define MBED_CONF_ATMEL_RF_ASSUME_SPACED_SPI 0
#endif
#if !defined(MBED_CONF_ATMEL_RF_FULL_SPI_SPEED_BYTE_SPACING)
	#define MBED_CONF_ATMEL_RF_FULL_SPI_SPEED_BYTE_SPACING 250
#endif
#if !defined(MBED_CONF_MCR20A_PROVIDE_DEFAULT)
	#define MBED_CONF_MCR20A_PROVIDE_DEFAULT 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_DATAFLASH_DATAFLASH_SIZE)
	#define MBED_CONF_DATAFLASH_DATAFLASH_SIZE 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_DATAFLASH_SPI_MISO)
	#define MBED_CONF_DATAFLASH_SPI_MISO NC
#endif
#if !defined(MBED_CONF_DATAFLASH_SPI_CLK)
	#define MBED_CONF_DATAFLASH_SPI_CLK NC
#endif
#if !defined(MBED_CONF_DATAFLASH_SPI_MOSI)
	#define MBED_CONF_DATAFLASH_SPI_MOSI NC
#endif
#if !defined(MBED_CONF_DATAFLASH_BINARY_SIZE)
	#define MBED_CONF_DATAFLASH_BINARY_SIZE 0
#endif
#if !defined(MBED_CONF_DATAFLASH_SPI_CS)
	#define MBED_CONF_DATAFLASH_SPI_CS NC
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_SD_SPI_MOSI)
	#define MBED_CONF_SD_SPI_MOSI NC
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_SD_SPI_MISO)
	#define MBED_CONF_SD_SPI_MISO NC
#endif
#if !defined(MBED_CONF_SD_SPI_CS)
	#define MBED_CONF_SD_SPI_CS NC
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_SD_DEVICE_SPI)
	#define MBED_CONF_SD_DEVICE_SPI 1
#endif
#if !defined(MBED_CONF_SD_SD_INIT_FREQUENCY)
	#define MBED_CONF_SD_SD_INIT_FREQUENCY 100000
#endif
#if !defined(MBED_CONF_SD_CMD_TIMEOUT)
	#define MBED_CONF_SD_CMD_TIMEOUT 10000
#endif
#if !defined(MBED_CONF_SD_SPI_CLK)
	#define MBED_CONF_SD_SPI_CLK NC
#endif
#if !defined(MBED_CONF_SD_CMD0_IDLE_STATE_RETRIES)
	#define MBED_CONF_SD_CMD0_IDLE_STATE_RETRIES 5
#endif
#if !defined(MBED_CONF_SD_FSFAT_SDCARD_INSTALLED)
	#define MBED_CONF_SD_FSFAT_SDCARD_INSTALLED 1
#endif
#if !defined(MBED_CONF_SPIF_DRIVER_SPI_MOSI)
	#define MBED_CONF_SPIF_DRIVER_SPI_MOSI p20
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_SPIF_DRIVER_SPI_CS)
	#define MBED_CONF_SPIF_DRIVER_SPI_CS p17
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_SPIF_DRIVER_SPI_MISO)
	#define MBED_CONF_SPIF_DRIVER_SPI_MISO p21
#endif
#if !defined(MBED_CONF_SPIF_DRIVER_SPI_CLK)
	#define MBED_CONF_SPIF_DRIVER_SPI_CLK p19
#endif
#if !defined(MBED_CONF_SPIF_DRIVER_SPI_FREQ)
	#define MBED_CONF_SPIF_DRIVER_SPI_FREQ 40000000
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_ESP8266_DEBUG)
	#define MBED_CONF_ESP8266_DEBUG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_ESP8266_PROVIDE_DEFAULT)
	#define MBED_CONF_ESP8266_PROVIDE_DEFAULT 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MEM_ALLOC)
	#define MEM_ALLOC malloc
#endif
#if !defined(MEM_FREE)
	#define MEM_FREE free
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(NRF_SDH_BLE_PERIPHERAL_LINK_COUNT)
	#define NRF_SDH_BLE_PERIPHERAL_LINK_COUNT 1
#endif
#if !defined(NRF_SDH_BLE_GATTS_ATTR_TAB_SIZE)
	#define NRF_SDH_BLE_GATTS_ATTR_TAB_SIZE 0x600
#endif
#if !defined(NRF_SDH_BLE_CENTRAL_LINK_COUNT)
	#define NRF_SDH_BLE_CENTRAL_LINK_COUNT 3
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(NRF_SDH_BLE_VS_UUID_COUNT)
	#define NRF_SDH_BLE_VS_UUID_COUNT 4
#endif
#if !defined(NRF_SDH_BLE_SERVICE_CHANGED)
	#define NRF_SDH_BLE_SERVICE_CHANGED 1
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(CFSTORE_STORAGE_DISABLE)
	#define CFSTORE_STORAGE_DISABLE 0
#endif
#if !defined(MBED_CONF_RTOS_TIMER_THREAD_STACK_SIZE)
	#define MBED_CONF_RTOS_TIMER_THREAD_STACK_SIZE 768
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_RTOS_IDLE_THREAD_STACK_SIZE)
	#define MBED_CONF_RTOS_IDLE_THREAD_STACK_SIZE 512
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_RTOS_THREAD_STACK_SIZE)
	#define MBED_CONF_RTOS_THREAD_STACK_SIZE 4096
#endif
#if !defined(MBED_CONF_RTOS_MAIN_THREAD_STACK_SIZE)
	#define MBED_CONF_RTOS_MAIN_THREAD_STACK_SIZE 4096
#endif
#if !defined(_RTE_)
	#define _RTE_
#endif
#if !defined(MBED_CONF_EVENTS_SHARED_EVENTSIZE)
	#define MBED_CONF_EVENTS_SHARED_EVENTSIZE 256
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_EVENTS_SHARED_DISPATCH_FROM_APPLICATION)
	#define MBED_CONF_EVENTS_SHARED_DISPATCH_FROM_APPLICATION 0
#endif
#if !defined(MBED_CONF_EVENTS_SHARED_STACKSIZE)
	#define MBED_CONF_EVENTS_SHARED_STACKSIZE 1024
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_EVENTS_SHARED_HIGHPRIO_STACKSIZE)
	#define MBED_CONF_EVENTS_SHARED_HIGHPRIO_STACKSIZE 1024
#endif
#if !defined(MBED_CONF_EVENTS_USE_LOWPOWER_TIMER_TICKER)
	#define MBED_CONF_EVENTS_USE_LOWPOWER_TIMER_TICKER 0
#endif
#if !defined(MBED_CONF_EVENTS_SHARED_HIGHPRIO_EVENTSIZE)
	#define MBED_CONF_EVENTS_SHARED_HIGHPRIO_EVENTSIZE 256
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_CELLULAR_RANDOM_MAX_START_DELAY)
	#define MBED_CONF_CELLULAR_RANDOM_MAX_START_DELAY 0
#endif
#if !defined(MBED_CONF_CELLULAR_USE_APN_LOOKUP)
	#define MBED_CONF_CELLULAR_USE_APN_LOOKUP 1
#endif
#if !defined(MBED_CONF_CELLULAR_DEBUG_AT)
	#define MBED_CONF_CELLULAR_DEBUG_AT 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_LORA_UPLINK_PREAMBLE_LENGTH)
	#define MBED_CONF_LORA_UPLINK_PREAMBLE_LENGTH 8
#endif
#if !defined(MBED_CONF_LORA_FSB_MASK_CHINA)
	#define MBED_CONF_LORA_FSB_MASK_CHINA {0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF}
#endif
#if !defined(MBED_CONF_LORA_AUTOMATIC_UPLINK_MESSAGE)
	#define MBED_CONF_LORA_AUTOMATIC_UPLINK_MESSAGE 1
#endif
#if !defined(MBED_CONF_LORA_TX_MAX_SIZE)
	#define MBED_CONF_LORA_TX_MAX_SIZE 64
#endif
#if !defined(MBED_CONF_LORA_APP_PORT)
	#define MBED_CONF_LORA_APP_PORT 15
#endif
#if !defined(MBED_CONF_LORA_DEVICE_ADDRESS)
	#define MBED_CONF_LORA_DEVICE_ADDRESS 0x00000000
#endif
#if !defined(MBED_CONF_LORA_DOWNLINK_PREAMBLE_LENGTH)
	#define MBED_CONF_LORA_DOWNLINK_PREAMBLE_LENGTH 5
#endif
#if !defined(MBED_CONF_LORA_NB_TRIALS)
	#define MBED_CONF_LORA_NB_TRIALS 12
#endif
#if !defined(MBED_CONF_LORA_MAX_SYS_RX_ERROR)
	#define MBED_CONF_LORA_MAX_SYS_RX_ERROR 10
#endif
#if !defined(MBED_CONF_LORA_DUTY_CYCLE_ON)
	#define MBED_CONF_LORA_DUTY_CYCLE_ON 1
#endif
#if !defined(MBED_CONF_LORA_APPSKEY)
	#define MBED_CONF_LORA_APPSKEY {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
#endif
#if !defined(MBED_CONF_LORA_OVER_THE_AIR_ACTIVATION)
	#define MBED_CONF_LORA_OVER_THE_AIR_ACTIVATION 1
#endif
#if !defined(MBED_CONF_LORA_DEVICE_EUI)
	#define MBED_CONF_LORA_DEVICE_EUI {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_LORA_APPLICATION_EUI)
	#define MBED_CONF_LORA_APPLICATION_EUI {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
#endif
#if !defined(MBED_CONF_LORA_PUBLIC_NETWORK)
	#define MBED_CONF_LORA_PUBLIC_NETWORK 1
#endif
#if !defined(MBED_CONF_LORA_PHY)
	#define MBED_CONF_LORA_PHY EU868
#endif
#if !defined(MBED_CONF_LORA_NWKSKEY)
	#define MBED_CONF_LORA_NWKSKEY {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
#endif
#if !defined(MBED_CONF_LORA_FSB_MASK)
	#define MBED_CONF_LORA_FSB_MASK {0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0x00FF}
#endif
#if !defined(MBED_CONF_LORA_LBT_ON)
	#define MBED_CONF_LORA_LBT_ON 0
#endif
#if !defined(MBED_CONF_LORA_APPLICATION_KEY)
	#define MBED_CONF_LORA_APPLICATION_KEY {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
#endif
#if !defined(MBED_CONF_LORA_DUTY_CYCLE_ON_JOIN)
	#define MBED_CONF_LORA_DUTY_CYCLE_ON_JOIN 1
#endif
#if !defined(MBED_CONF_LORA_ADR_ON)
	#define MBED_CONF_LORA_ADR_ON 1
#endif
#if !defined(MBED_CONF_LWIP_IPV6_ENABLED)
	#define MBED_CONF_LWIP_IPV6_ENABLED 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_LWIP_TCP_SOCKET_MAX)
	#define MBED_CONF_LWIP_TCP_SOCKET_MAX 4
#endif
#if !defined(MBED_CONF_LWIP_ENABLE_PPP_TRACE)
	#define MBED_CONF_LWIP_ENABLE_PPP_TRACE 0
#endif
#if !defined(NSAPI_PPP_AVAILABLE)
	#define NSAPI_PPP_AVAILABLE 0
#endif
#if !defined(NSAPI_PPP_IPV4_AVAILABLE)
	#define NSAPI_PPP_IPV4_AVAILABLE 1
#endif
#if !defined(MBED_CONF_LWIP_USE_MBED_TRACE)
	#define MBED_CONF_LWIP_USE_MBED_TRACE 0
#endif
#if !defined(MBED_CONF_LWIP_TCP_ENABLED)
	#define MBED_CONF_LWIP_TCP_ENABLED 1
#endif
#if !defined(MBED_CONF_LWIP_TCP_SERVER_MAX)
	#define MBED_CONF_LWIP_TCP_SERVER_MAX 4
#endif
#if !defined(MBED_CONF_LWIP_PPP_THREAD_STACKSIZE)
	#define MBED_CONF_LWIP_PPP_THREAD_STACKSIZE 768
#endif
#if !defined(MBED_CONF_LWIP_ADDR_TIMEOUT)
	#define MBED_CONF_LWIP_ADDR_TIMEOUT 5
#endif
#if !defined(MBED_CONF_LWIP_ADDR_TIMEOUT_MODE)
	#define MBED_CONF_LWIP_ADDR_TIMEOUT_MODE 1
#endif
#if !defined(MBED_CONF_LWIP_ETHERNET_ENABLED)
	#define MBED_CONF_LWIP_ETHERNET_ENABLED 1
#endif
#if !defined(NSAPI_PPP_IPV6_AVAILABLE)
	#define NSAPI_PPP_IPV6_AVAILABLE 0
#endif
#if !defined(MBED_CONF_LWIP_DEFAULT_THREAD_STACKSIZE)
	#define MBED_CONF_LWIP_DEFAULT_THREAD_STACKSIZE 512
#endif
#if !defined(MBED_CONF_LWIP_IPV4_ENABLED)
	#define MBED_CONF_LWIP_IPV4_ENABLED 1
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_LWIP_DEBUG_ENABLED)
	#define MBED_CONF_LWIP_DEBUG_ENABLED 0
#endif
#if !defined(MBED_CONF_LWIP_TCPIP_THREAD_STACKSIZE)
	#define MBED_CONF_LWIP_TCPIP_THREAD_STACKSIZE 1200
#endif
#if !defined(MBED_CONF_LWIP_IP_VER_PREF)
	#define MBED_CONF_LWIP_IP_VER_PREF 4
#endif
#if !defined(MBED_CONF_LWIP_UDP_SOCKET_MAX)
	#define MBED_CONF_LWIP_UDP_SOCKET_MAX 4
#endif
#if !defined(MBED_CONF_LWIP_SOCKET_MAX)
	#define MBED_CONF_LWIP_SOCKET_MAX 4
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
