tai/mbed-os/platformio/variants/NRF52840_DK/mbed_config.h
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_MASTER_KEY)
	#define MBED_CONF_MBED_MESH_API_THREAD_MASTER_KEY {0x10, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0xaa, 0xbb, 0xcc, 0xdd, 0xee, 0xff}
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_ML_PREFIX)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_ML_PREFIX {0xfd, 0x0, 0x0d, 0xb8, 0x0, 0x0, 0x0, 0x0}
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_USE_STATIC_LINK_CONFIG)
	#define MBED_CONF_MBED_MESH_API_THREAD_USE_STATIC_LINK_CONFIG 1
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_DEVICE_TYPE)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_DEVICE_TYPE NET_6LOWPAN_ROUTER
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_PSKD)
	#define MBED_CONF_MBED_MESH_API_THREAD_PSKD "ABCDEFGH"
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_DEVICE_TYPE)
	#define MBED_CONF_MBED_MESH_API_THREAD_DEVICE_TYPE MESH_DEVICE_TYPE_THREAD_ROUTER
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL_MASK)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL_MASK 0x7fff800
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_PSKC)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_PSKC {0xc8, 0xa6, 0x2e, 0xae, 0xf3, 0x68, 0xf3, 0x46, 0xa9, 0x9e, 0x57, 0x85, 0x98, 0x9d, 0x1c, 0xd0}
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL 0
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_PANID_FILTER)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_PANID_FILTER 0xffff
#endif
#if !defined(MBED_CONF_MBED_MESH_API_HEAP_SIZE)
	#define MBED_CONF_MBED_MESH_API_HEAP_SIZE 32500
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_SEC_LEVEL)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_SEC_LEVEL 5
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_PSK_KEY_ID)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_PSK_KEY_ID 1
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_NETWORK_NAME)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_NETWORK_NAME "Thread Network"
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL_PAGE)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL_PAGE 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_CHANNEL)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_CHANNEL 22
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_PSK_KEY)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_PSK_KEY {0xa0, 0xa1, 0xa2, 0xa3, 0xa4, 0xa5, 0xa6, 0xa7, 0xa8, 0xa9, 0xaa, 0xab, 0xac, 0xad, 0xae, 0xaf}
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_COMMISSIONING_DATASET_TIMESTAMP)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_COMMISSIONING_DATASET_TIMESTAMP 0x10000
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_SECURITY_POLICY)
	#define MBED_CONF_MBED_MESH_API_THREAD_SECURITY_POLICY 255
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_CHANNEL_MASK)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_CHANNEL_MASK 0x7fff800
#endif
#if !defined(MBED_CONF_MBED_MESH_API_6LOWPAN_ND_SECURITY_MODE)
	#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_SECURITY_MODE NONE
#endif
#if !defined(MBED_CONF_MBED_MESH_API_USE_MALLOC_FOR_HEAP)
	#define MBED_CONF_MBED_MESH_API_USE_MALLOC_FOR_HEAP 0
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_EXTENDED_PANID)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_EXTENDED_PANID {0xf1, 0xb5, 0xa1, 0xb2,0xc4, 0xd5, 0xa1, 0xbd }
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_CHANNEL_PAGE)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_CHANNEL_PAGE 0
#endif
#if !defined(MBED_CONF_MBED_MESH_API_THREAD_CONFIG_PANID)
	#define MBED_CONF_MBED_MESH_API_THREAD_CONFIG_PANID 0x0700
#endif
#if !defined(MBED_CONF_MBED_MESH_API_HEAP_STAT_INFO)
	#define MBED_CONF_MBED_MESH_API_HEAP_STAT_INFO NULL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NANOSTACK_HAL_EVENT_LOOP_USE_MBED_EVENTS)
	#define MBED_CONF_NANOSTACK_HAL_EVENT_LOOP_USE_MBED_EVENTS 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NANOSTACK_HAL_CRITICAL_SECTION_USABLE_FROM_INTERRUPT)
	#define MBED_CONF_NANOSTACK_HAL_CRITICAL_SECTION_USABLE_FROM_INTERRUPT 0
#endif
#if !defined(MBED_CONF_NANOSTACK_HAL_EVENT_LOOP_THREAD_STACK_SIZE)
	#define MBED_CONF_NANOSTACK_HAL_EVENT_LOOP_THREAD_STACK_SIZE 6144
#endif
#if !defined(MBED_CONF_NANOSTACK_HAL_EVENT_LOOP_DISPATCH_FROM_APPLICATION)
	#define MBED_CONF_NANOSTACK_HAL_EVENT_LOOP_DISPATCH_FROM_APPLICATION 0
#endif
#if !defined(MBED_CONF_NANOSTACK_HAL_NVM_CFSTORE)
	#define MBED_CONF_NANOSTACK_HAL_NVM_CFSTORE 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NANOSTACK_CONFIGURATION)
	#define MBED_CONF_NANOSTACK_CONFIGURATION nanostack_full
#endif
#if !defined(NS_USE_EXTERNAL_MBED_TLS)
	#define NS_USE_EXTERNAL_MBED_TLS
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_PPP_CELL_IFACE_APN_LOOKUP)
	#define MBED_CONF_PPP_CELL_IFACE_APN_LOOKUP 1
#endif
#if !defined(MBED_CONF_NSAPI_DNS_RESPONSE_WAIT_TIME)
	#define MBED_CONF_NSAPI_DNS_RESPONSE_WAIT_TIME 5000
#endif
#if !defined(MBED_CONF_PPP_CELL_IFACE_AT_PARSER_BUFFER_SIZE)
	#define MBED_CONF_PPP_CELL_IFACE_AT_PARSER_BUFFER_SIZE 256
#endif
#if !defined(MBED_CONF_NSAPI_DNS_CACHE_SIZE)
	#define MBED_CONF_NSAPI_DNS_CACHE_SIZE 3
#endif
#if !defined(MBED_CONF_NSAPI_DEFAULT_WIFI_SECURITY)
	#define MBED_CONF_NSAPI_DEFAULT_WIFI_SECURITY NONE
#endif
#if !defined(MBED_CONF_NSAPI_DEFAULT_MESH_TYPE)
	#define MBED_CONF_NSAPI_DEFAULT_MESH_TYPE THREAD
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NSAPI_DNS_RETRIES)
	#define MBED_CONF_NSAPI_DNS_RETRIES 0
#endif
#if !defined(MBED_CONF_NSAPI_DEFAULT_STACK)
	#define MBED_CONF_NSAPI_DEFAULT_STACK LWIP
#endif
#if !defined(MBED_CONF_PPP_CELL_IFACE_BAUD_RATE)
	#define MBED_CONF_PPP_CELL_IFACE_BAUD_RATE 115200
#endif
#if !defined(MBED_CONF_NSAPI_DNS_TOTAL_ATTEMPTS)
	#define MBED_CONF_NSAPI_DNS_TOTAL_ATTEMPTS 3
#endif
#if !defined(MBED_CONF_PPP_CELL_IFACE_AT_PARSER_TIMEOUT)
	#define MBED_CONF_PPP_CELL_IFACE_AT_PARSER_TIMEOUT 8000
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_LFS_LOOKAHEAD)
	#define MBED_LFS_LOOKAHEAD 512
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_LFS_INTRINSICS)
	#define MBED_LFS_INTRINSICS 1
#endif
#if !defined(MBED_LFS_READ_SIZE)
	#define MBED_LFS_READ_SIZE 64
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_LFS_ENABLE_INFO)
	#define MBED_LFS_ENABLE_INFO 0
#endif
#if !defined(MBED_LFS_PROG_SIZE)
	#define MBED_LFS_PROG_SIZE 64
#endif
#if !defined(MBED_LFS_BLOCK_SIZE)
	#define MBED_LFS_BLOCK_SIZE 512
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(NVSTORE_MAX_KEYS)
	#define NVSTORE_MAX_KEYS 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(NVSTORE_ENABLED)
	#define NVSTORE_ENABLED 1
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_MODE_CONFIG 0
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_CALIB_TIMER_INTERVAL 16
#endif
#if !defined(MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC)
	#define MBED_CONF_NORDIC_NRF_LF_CLOCK_SRC NRF_LF_SRC_XTAL
#endif


# endif
